In [1]:
import pandas as pd
import matplotlib.pyplot as plt
from sqlalchemy import create_engine
from config import username, password, database

from sqlalchemy import Column, Integer, String, Float

In [2]:
#create engine to talk to the database
engine = create_engine(f"postgresql://{username}:{password}@localhost:5432/{database}")
conn=engine.connect()

In [3]:
#query required records in the database 
data=pd.read_sql("select * from placement_type",conn)
data2=pd.read_sql("select * from exiting_protective_order",conn)
data3=pd.read_sql("select * from exiting_length_ohc",conn)
data4=pd.read_sql("select * from commence_exit_by_state",conn)

In [4]:
data

     start_date  end_date placement_type
0       1072012  30062013   Kinship care
1       1072012  30062013   Kinship care
2       1072012  30062013   Kinship care
3       1072012  30062013    Foster care
4       1072012  30062013    Residential
...         ...       ...            ...
2681    1072012  30062013    Foster care
2682    1072012  30062013    Foster care
2683    1072012  30062013    Foster care
2684    1072012  30062013    Foster care
2685    1072012  30062013    Foster care

[2686 rows x 3 columns]

In [15]:
placement = (data.groupby('placement_type').count())
placement

                start_date  end_date
placement_type
Foster care           1869      1869
Kinship care           336       336
Residential            481       481